<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","label":"staging","backend":"92a6c921f477bc9669a4dc51b742afada42007d9b86999956c9943bdcdfb7a70","plan_job_ref":"Job Terraform plan #22 at https://github.com/GSA-TTS/FAC/actions/runs/4264000345","plan_hash":"f6503fb1db83e117adc7e39f8281bf208f6e2e1895e5625a4f9c3f852e1034eb","plan_text_format":"text","version":"1.31.1"} -->
Terraform plan for __staging__
<details>
<summary>Plan: 3 to add, 0 to change, 0 to destroy.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.staging.module.clamav.cloudfoundry_app.clamav_api will be created
  + resource "cloudfoundry_app" "clamav_api" {
      + buildpack                  = (known after apply)
      + disk_quota                 = 2048
      + docker_image               = "ajilaag/clamav-rest:20230224"
      + enable_ssh                 = (known after apply)
      + environment                = (sensitive value)
      + health_check_http_endpoint = (known after apply)
      + health_check_timeout       = (known after apply)
      + health_check_type          = "port"
      + id                         = (known after apply)
      + id_bg                      = (known after apply)
      + instances                  = (known after apply)
      + memory                     = 3072
      + name                       = "fac-av-staging"
      + ports                      = (known after apply)
      + space                      = "7bbe587a-e8ee-4e8c-b32f-86d0b0f1b807"
      + stack                      = (known after apply)
      + stopped                    = false
      + strategy                   = "none"
      + timeout                    = 600

      + routes {
          + port  = (known after apply)
          + route = (known after apply)
        }
    }

  # module.staging.module.clamav.cloudfoundry_network_policy.clamav_routing will be created
  + resource "cloudfoundry_network_policy" "clamav_routing" {
      + id = (known after apply)

      + policy {
          + destination_app = (known after apply)
          + port            = "61443"
          + protocol        = "tcp"
          + source_app      = "38f7f948-e7b4-4e8f-8ff4-7c89213ad857"
        }
    }

  # module.staging.module.clamav.cloudfoundry_route.clamav_route will be created
  + resource "cloudfoundry_route" "clamav_route" {
      + domain   = "26df58ef-0c0d-4997-b68b-8defb7b3998b"
      + endpoint = (known after apply)
      + hostname = "fac-av-staging"
      + id       = (known after apply)
      + port     = (known after apply)
      + space    = "7bbe587a-e8ee-4e8c-b32f-86d0b0f1b807"
    }

Plan: 3 to add, 0 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Terraform plan #22](https://github.com/GSA-TTS/FAC/actions/runs/4264000345)